БухЭксп/Catalogs/CW_ФильтрыСистемныхСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ФильтрыСистемныхСообщений</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Использование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборПоПриоритету</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантФильтрацииПоИсточнику</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетнаяЗапись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТемаСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расписание</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Приоритеты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Приоритет</Name>
							<Type>
								<v8:Type>cfg:EnumRef.CW_ПриоритетыСистемныхСообщений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Источники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Источник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_ИсточникиСистемныхСообщений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Получатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:EnumRef.CW_ВидыПолучателейЭлектронныхПисем</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтображаемоеИмя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Enums/CW_ПриоритетыСистемныхСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ПриоритетыСистемныхСообщений</Name>
			<Comment>Приоритеты по RFC 5424</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>p0</Name>
					<Comment>Emergency (panic)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>p1</Name>
					<Comment>Alert (alert)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>p2</Name>
					<Comment>Critical (crit)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>p3</Name>
					<Comment>Error (error)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>p4</Name>
					<Comment>Warning (warning)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>p5</Name>
					<Comment>Notice (notice)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>p6</Name>
					<Comment>Informational (info)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>p7</Name>
					<Comment>Debug (debug)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Catalogs/CW_ФильтрыСистемныхСообщений/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// формируем заголовки флажков приоритетов
	Для каждого ЗП Из Метаданные.Перечисления.CW_ПриоритетыСистемныхСообщений.ЗначенияПеречисления Цикл
		
		Индекс = Прав(ЗП.Имя,1);
		Элементы["п"+Индекс].Заголовок = ЗП.Синоним;
		
	КонецЦикла; 
	
	_ПрочитатьЗначенияПриоритетов();
	
	// --- 
	
	Расписания.Очистить();
	РасписаниеРЗ = РеквизитФормыВЗначение("Объект").Расписание.Получить();
	Если РасписаниеРЗ <> Неопределено Тогда
		
		Элементы.Расписание.Заголовок = "Расписание ("+Строка(РасписаниеРЗ)+")";
		Расписания.Добавить(РасписаниеРЗ);
		
	КонецЕсли; 
	
	// --- 
	
	_УправлениеЭлементамиФормы();
	//Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);

КонецПроцедуры

&НаСервере
Процедура _ПрочитатьЗначенияПриоритетов()
	// --- 
	
	п0 = Ложь;
	п1 = Ложь;
	п2 = Ложь;
	п3 = Ложь;
	п4 = Ложь;
	п5 = Ложь;
	п6 = Ложь;
	п7 = Ложь;
	// --- 
	
	Для каждого Стр Из Объект.Приоритеты Цикл
		
		Индекс = _ПолучитьИндекс(Стр.Приоритет);
		ЭтаФорма["п"+Индекс]=Истина;
		
	КонецЦикла; 
	
	// --- 
КонецПроцедуры

&НаСервере
Функция _ПолучитьИндекс(ЗП)
	// --- 
	
	Если ЗП = Перечисления.CW_ПриоритетыСистемныхСообщений.p0 Тогда
		
		Возврат("0");
		
	ИначеЕсли ЗП = Перечисления.CW_ПриоритетыСистемныхСообщений.p1 Тогда 
		
		Возврат("1"); 
		
	ИначеЕсли ЗП = Перечисления.CW_ПриоритетыСистемныхСообщений.p2 Тогда 
		
		Возврат("2"); 

	ИначеЕсли ЗП = Перечисления.CW_ПриоритетыСистемныхСообщений.p3 Тогда 
		
		Возврат("3"); 

	ИначеЕсли ЗП = Перечисления.CW_ПриоритетыСистемныхСообщений.p4 Тогда 
		
		Возврат("4"); 
		
	ИначеЕсли ЗП = Перечисления.CW_ПриоритетыСистемныхСообщений.p5 Тогда 
		
		Возврат("5"); 

	ИначеЕсли ЗП = Перечисления.CW_ПриоритетыСистемныхСообщений.p6 Тогда 
		
		Возврат("6"); 

    ИначеЕсли ЗП = Перечисления.CW_ПриоритетыСистемныхСообщений.p7 Тогда 
		
		Возврат("7"); 
		
	КонецЕсли; 
	
	// --- 
КонецФункции
   

&НаСервере
Процедура _УправлениеЭлементамиФормы()
	// --- 
	
	Элементы.ГруппаПриоритеты.ТолькоПросмотр = (НЕ Объект.ОтборПоПриоритету);
	
	Элементы.Источники.ТолькоПросмотр = (Объект.ВариантФильтрацииПоИсточнику = 0);
	
	// --- 
КонецПроцедуры


&НаКлиенте
Процедура ОтборПоПриоритетуПриИзменении(Элемент)
	
	_ОтборПоПриоритетуПриИзменении();
	
КонецПроцедуры
 
&НаСервере
Процедура _ОтборПоПриоритетуПриИзменении()
	// --- 
	
	Если НЕ Объект.ОтборПоПриоритету Тогда
		
		Объект.Приоритеты.Очистить();
		_ПрочитатьЗначенияПриоритетов();
		
	КонецЕсли; 
	
	_УправлениеЭлементамиФормы();
	
	// --- 
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура п0ПриИзменении(Элемент)
	_ПриоритетПриИзменении(Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура п1ПриИзменении(Элемент)
	_ПриоритетПриИзменении(Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура п2ПриИзменении(Элемент)
	_ПриоритетПриИзменении(Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура п3ПриИзменении(Элемент)
	_ПриоритетПриИзменении(Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура п4ПриИзменении(Элемент)
	_ПриоритетПриИзменении(Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура п5ПриИзменении(Элемент)
	_ПриоритетПриИзменении(Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура п6ПриИзменении(Элемент)
	_ПриоритетПриИзменении(Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура п7ПриИзменении(Элемент)
	_ПриоритетПриИзменении(Элемент.Имя);
КонецПроцедуры

// --- 

&НаСервере
Процедура _ПриоритетПриИзменении(ИмяЭлемента)
	// --- 
	
	Значение = ЭтаФорма[ИмяЭлемента];
	ЗП = Перечисления.CW_ПриоритетыСистемныхСообщений["p"+Прав(ИмяЭлемента,1)];
	Если Значение Тогда
		
		// добавляем
		Нстр = Объект.Приоритеты.Добавить();
		Нстр.Приоритет = ЗП;

		
		
	Иначе
		
		// удаляем
		Строка = _сф.к_НайтиСтроку(Объект.Приоритеты,"Приоритет",ЗП);
		Если Строка <> Неопределено Тогда
			
			Объект.Приоритеты.Удалить(Строка);
			
		КонецЕсли; 
				
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ВариантФильтрацииПоИсточникуПриИзменении(Элемент)
	
	_ВариантФильтрацииПоИсточникуПриИзменении();
	
КонецПроцедуры

&НаСервере
Процедура _ВариантФильтрацииПоИсточникуПриИзменении()
	// --- 
	
	Если Объект.ВариантФильтрацииПоИсточнику=0 Тогда
		
		Объект.Источники.Очистить();
		
	КонецЕсли; 
	
	_УправлениеЭлементамиФормы();
	
	// --- 
КонецПроцедуры

// --- 

&НаКлиенте
Процедура ИсточникиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	ПОВ = Новый ОписаниеОповещения("ОбработкаДобавленияИсточника",ЭтотОбъект); 
	ОткрытьФорму("Справочник.CW_ИсточникиСистемныхСообщений.ФормаВыбора",Новый Структура("РежимВыбора",Истина),,,,,ПОВ, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаДобавленияИсточника(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Ответ <> Неопределено) Тогда
		
		// проверяем, не дубль ли
		Если НЕ _ДобавитьИсточник(Ответ) Тогда
			
			_УФК.ВывестиПредупреждение("Источник уже добавлен.");
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
  

&НаСервере
Функция _ДобавитьИсточник(Источник)
	// --- 
	
	Строка = _сф.к_НайтиСтроку(Объект.Источники,"Источник",Источник);
	Если Строка = Неопределено Тогда
		
		Нстр = Объект.Источники.Добавить();
		Нстр.Источник = Источник;
		Возврат(Истина);
		
	Иначе
		
		Возврат(Ложь);
		
	КонецЕсли; 
	
	// --- 
КонецФункции

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура РасписаниеНажатие(Элемент)
	
	Если Расписания.Количество() > 0 Тогда
        РасписаниеРЗ = Расписания.Получить(0).Значение;
    Иначе
        РасписаниеРЗ = Неопределено;
    КонецЕсли;
	
	Если РасписаниеРЗ = Неопределено Тогда
		
		РасписаниеРЗ = Новый РасписаниеРегламентногоЗадания;
		
	КонецЕсли;
	
	ДиалогРасписания = Новый ДиалогРасписанияРегламентногоЗадания(РасписаниеРЗ);
	ПОВ = Новый ОписаниеОповещения("ОбработкаИзмененияРасписания",ЭтотОбъект); 
	ДиалогРасписания.Показать(ПОВ);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаИзмененияРасписания(РасписаниеОтвет, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Расписания.Очистить();
	Расписания.Добавить(РасписаниеОтвет);
	Элементы.Расписание.Заголовок = "Расписание ("+Строка(РасписаниеОтвет)+")";
	
	// --- 
КонецПроцедуры
  

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Расписания.Количество() <> 0 Тогда
		
		ТекущийОбъект.Расписание = Новый ХранилищеЗначения(Расписания.Получить(0).Значение);
		
	КонецЕсли; 
	
КонецПроцедуры
 
 #Область Подключаемые_внешние_команды

&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя, Элементы.Список.ВыделенныеСтроки);
	
КонецПроцедуры

#КонецОбласти
